# ProjectInformation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..ProjectInformation Property
Document Class See Also
---
Return the Project Information of the current project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ProjectInfo ProjectInformation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProjectInformation As ProjectInfo
	Get
```

Visual C++
---
```text
public:
property ProjectInfo^ ProjectInformation {
	ProjectInfo^ get ();
}
```

# ### Return Value
Autodesk::Revit::DB::ProjectInfo
# See Also
Document Class
Autodesk.Revit.DB Namespace